In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('income.csv')
df

        name   income
0        Rob     5000
1      Rafiq     6000
2       Nina     4000
3      sofia     7500
4      Mohan     8000
5        Tao     7000
6  Elon Musk  1000000

In [3]:
df.describe()

               income
count        7.000000
mean    148214.285714
std     375604.829702
min       4000.000000
25%       5500.000000
50%       7000.000000
75%       7750.000000
max    1000000.000000

In [4]:
df.income.quantile(0.75)

7750.0

In [6]:
df.income.quantile(0.25)

5000

In [7]:
df.income.quantile(0.75, interpolation='lower') # lower percentile value

7500

In [8]:
df.income.quantile(0.75, interpolation='higher') #higher percentile value

8000

In [9]:
df_percentile_99 = df.income.quantile(0.99)
df_percentile_99

940479.9999999995

In [10]:
df_no_outlier = df[df.income <= df_percentile_99] 

df_no_outlier

    name  income
0    Rob    5000
1  Rafiq    6000
2   Nina    4000
3  sofia    7500
4  Mohan    8000
5    Tao    7000